# YOffsetValue Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..YOffsetValue Property
ParameterTypeId Class See Also
---
"y Offset Value"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId YOffsetValue { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property YOffsetValue As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ YOffsetValue {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace